cool/tutorials/compressible/rhoCentralFoam/shockTube/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

surfaceFormat   vtk;

sets
(
    line
    {
        type    face;
        axis    x;
        start   ( -5 0 0 );
        end     ( 5 0 0 );
        nPoints 100;
    }
);

surfaces        ();

fields          ( p U.component(0) T rho );

// ************************************************************************* //
